DataProcessors/фин_РеструктуризацияДанныхБюджетированияПриИзмененииРазрезовПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>фин_РеструктуризацияДанныхБюджетированияПриИзмененииРазрезовПланирования</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/фин_НастройкаДополнительныхРазрезовБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>фин_НастройкаДополнительныхРазрезовБюджетирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Разрез</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляКомплектаБюджетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Измерение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/фин_НастройкаЗависимостейМеждуФинансовымиПоказателями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>фин_НастройкаЗависимостейМеждуФинансовымиПоказателями</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.фин_ЗависимостиФинансовыхПоказателей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ВидыОперацийНастройкаЗависимостей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеЗависимостей</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ИспользованиеЗависимостейСтатейОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_НастройкиРасчетаЗависимостейБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинансовыйПоказательВлияющая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
						<v8:Type>cfg:CatalogRef.фин_АгрегатыФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияКлассификатора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_КлассификаторСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Агрегаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Агрегат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_АгрегатыФинансовыхПоказателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗависимостиОборотовПоСтатьям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДополнительныеРазрезы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_КлассификаторНаборовДополнительныхРазрезов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныйКоэффициентКоличества</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_РеквизитыДляРасчетаЗависимыхСтатейБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныйКоэффициентСуммы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_РеквизитыДляРасчетаЗависимыхСтатейБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗависимаяФинансовыйПоказатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
								<v8:Type>cfg:CatalogRef.фин_АгрегатыФинансовыхПоказателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеИзмененияПоПериодам</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ПрофилиИзмененияПлановПоПериодам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:EnumRef.фин_СпособыРасчетаРазрезовПоЗависимостям</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентДляРасчетаКоличества</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентДляРасчетаСуммы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.фин_ТипИсточникаНоменклатураДляЗависимостей</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.фин_ТипИсточникаПроектДляЗависимостей</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез10</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез4</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез5</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез6</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез7</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез8</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез9</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитВлияющейСтатьиДляРасчетаКоличества</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_РеквизитыДляРасчетаЗависимыхСтатейБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитВлияющейСтатьиДляРасчетаСуммы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_РеквизитыДляРасчетаЗависимыхСтатейБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УправленческоеПодразделение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.фин_ТипИсточникаУправленческоеПодразделениеДляЗависимостей</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбластьДействияЗависимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОграниченияОбластиДействия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ВидыОграниченийОбластиДействияЗависимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Измерение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеНаЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставАгрегатов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Агрегат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_АгрегатыФинансовыхПоказателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФинансовыйПоказатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпискиПараметровОтбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Измерение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеНаЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.фин_ВидыСубконтоБюджетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/фин_РеструктуризацияДанныхБюджетированияПриИзмененииРазрезовПланирования/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК Применить,
		|	Бюджет.ФормируемыйБюджет КАК Бюджет,
		|	Бюджет.Сценарий КАК Сценарий,
		|	Бюджет.Ссылка КАК Документ,
		|	Бюджет.ПериодПланирования,
		|	Бюджет.ВидОперации,
		|	Бюджет.Организация,
		|	Бюджет.Проведен
		|ИЗ
		|	Документ.фин_Бюджет КАК Бюджет
		|ГДЕ
		|	(НЕ Бюджет.ПометкаУдаления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Бюджет.ФормируемыйБюджет,
		|	Бюджет.Дата
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Применить)
		|ПО
		|	Бюджет,
		|	Сценарий";

	Результат = Запрос.Выполнить();
	ЗначениеВРеквизитФормы(Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам),"СписокБюджетов");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК Применить,
		|	НастройкаЗависимостей.ФинансовыйПоказательВлияющая КАК ФинансовыйПоказатель,
		|	НастройкаЗависимостей.Ссылка КАК Документ,
		|	НастройкаЗависимостей.ВидОперации,
		|	НастройкаЗависимостей.Организация,
		|	НастройкаЗависимостей.Проведен
		|ИЗ
		|	Документ.фин_НастройкаЗависимостейМеждуФинансовымиПоказателями КАК НастройкаЗависимостей
		|ГДЕ
		|	(НЕ НастройкаЗависимостей.ПометкаУдаления)
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Применить)
		|ПО
		|	ФинансовыйПоказательВлияющая";

	Результат = Запрос.Выполнить();
	ЗначениеВРеквизитФормы(Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам),"СписокНастройкиКонтролируемых");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК Применить,
		|	УстановкаКонтролируемыхФинансовыхПоказателей.Ссылка КАК Документ,
		|	УстановкаКонтролируемыхФинансовыхПоказателей.Организация КАК Организация,
		|	УстановкаКонтролируемыхФинансовыхПоказателей.Проведен
		|ИЗ
		|	Документ.фин_УстановкаЛимитовИЦелевыхЗначений КАК УстановкаКонтролируемыхФинансовыхПоказателей
		|ГДЕ
		|	(НЕ УстановкаКонтролируемыхФинансовыхПоказателей.ПометкаУдаления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	УстановкаКонтролируемыхФинансовыхПоказателей.Дата
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Документ)
		|ПО
		|	Организация";

	Результат = Запрос.Выполнить();
	ЗначениеВРеквизитФормы(Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам),"СписокНастройкиКонтролируемых");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК Применить,
		|	УчетФактическихДанныхПоБюджетам.Ссылка КАК Документ,
		|	УчетФактическихДанныхПоБюджетам.Организация КАК Организация,
		|	УчетФактическихДанныхПоБюджетам.Проведен
		|ИЗ
		|	Документ.фин_УчетФактическихДанныхПоБюджетам КАК УчетФактическихДанныхПоБюджетам
		|ГДЕ
		|	(НЕ УчетФактическихДанныхПоБюджетам.ПометкаУдаления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	УчетФактическихДанныхПоБюджетам.Дата
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Документ)
		|ПО
		|	Организация";

	Результат = Запрос.Выполнить();
	ЗначениеВРеквизитФормы(Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам),"СписокФактическиеДанные");
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокБюджетовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если Элемент.ТекущиеДанные.ПолучитьЭлементы().Количество()>0 Тогда
		УстановитьФлажкиВПодчиненных(Элемент.ТекущиеДанные.ПолучитьЭлементы(),Элемент.ТекущиеДанные.Применить);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиВПодчиненных(Строки, Пометка)
	Для Каждого СтрокаПодчиненная Из Строки Цикл
		СтрокаПодчиненная.Применить = Пометка;
		УстановитьФлажкиВПодчиненных(СтрокаПодчиненная.ПолучитьЭлементы(),Пометка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьФлажкиВПодчиненных(СписокБюджетов.ПолучитьЭлементы(),Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьФлажкиВПодчиненных(СписокБюджетов.ПолучитьЭлементы(),Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ОбработатьДокументы();
КонецПроцедуры

&НаСервере
Процедура ОбработатьДокументы()
	Дерево = РеквизитФормыВЗначение("СписокБюджетов");	
	Обработать(Дерево.Строки);
КонецПроцедуры

&НаСервере
Процедура Обработать(Строки)
	Для Каждого СтрокаПодчиненная Из Строки Цикл
		Если СтрокаПодчиненная.Применить И ЗначениеЗаполнено(СтрокаПодчиненная.Документ) Тогда
			фин_РаботаСДополнительнымиРазрезамиБюджетирования.ОбработатьРазрезыДокумента(СтрокаПодчиненная.Документ);
		КонецЕсли;
		Обработать(СтрокаПодчиненная.Строки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗависимостиВыполнить(Команда)
	ОбработатьДокументыЗависимостей();
КонецПроцедуры

&НаСервере
Процедура ОбработатьДокументыЗависимостей()
	Дерево = РеквизитФормыВЗначение("СписокНастройкиКонтролируемых");	
	Обработать(Дерево.Строки);
КонецПроцедуры

&НаСервере
Процедура ОбработатьДокументыКонтролируемых()
	Дерево = РеквизитФормыВЗначение("СписокЗависимостей");	
	Обработать(Дерево.Строки);
КонецПроцедуры

&НаСервере
Процедура ОбработатьФактическиеДокументы()
	Дерево = РеквизитФормыВЗначение("СписокФактическиеДанные");	
	Обработать(Дерево.Строки);
КонецПроцедуры

&НаКлиенте
Процедура ЗависимостиСнятьФлажки(Команда)
	УстановитьФлажкиВПодчиненных(СписокЗависимостей.ПолучитьЭлементы(),Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗависимостиУстановитьФлажки(Команда)
	УстановитьФлажкиВПодчиненных(СписокЗависимостей.ПолучитьЭлементы(),Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСловарныеТермины(Команда)
     ИзменениеСловарныхТерминов();
КонецПроцедуры

&НаСервере
Процедура ИзменениеСловарныхТерминов()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаДополнительныхРазрезовБюджетирования.Измерение,
		|	НастройкаДополнительныхРазрезовБюджетирования.Разрез
		|ИЗ
		|	РегистрСведений.фин_НастройкаДополнительныхРазрезовБюджетирования КАК НастройкаДополнительныхРазрезовБюджетирования";

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		ИмяРазреза 			= фин_РаботаСДополнительнымиРазрезамиБюджетирования.ИмяРазреза(Выборка.Измерение);
		СправочникОбъект 	= Справочники.фин_СлужебныеТерминыБюджетирования[ИмяРазреза].ПолучитьОбъект();
		СправочникОбъект.Наименование = фин_РаботаСДополнительнымиРазрезамиБюджетирования.ПредставлениеРазреза(Выборка.Измерение);
		Попытка
			СправочникОбъект.Записать();
		Исключение
			Сообщить("Не обработан элемент "+Справочники.фин_СлужебныеТерминыБюджетирования[ИмяРазреза]);
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КонтролируемыеСнятьФлажки(Команда)
	УстановитьФлажкиВПодчиненных(СписокНастройкиКонтролируемых.ПолучитьЭлементы(),Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КонтролируемыеУстановитьФлажки(Команда)
	УстановитьФлажкиВПодчиненных(СписокНастройкиКонтролируемых.ПолучитьЭлементы(),Истина);
КонецПроцедуры

&НаКлиенте
Процедура КонтролируемыеВыполнить(Команда)
	ОбработатьДокументыКонтролируемых();
КонецПроцедуры

&НаКлиенте
Процедура ФактическиеСнятьФлажки(Команда)
	УстановитьФлажкиВПодчиненных(СписокФактическиеДанные.ПолучитьЭлементы(),Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ФактическиеУстановитьФлажки(Команда)
	УстановитьФлажкиВПодчиненных(СписокФактическиеДанные.ПолучитьЭлементы(),Истина);
КонецПроцедуры

&НаКлиенте
Процедура ФактическиеВыполнить(Команда)
	ОбработатьФактическиеДокументы();
КонецПроцедуры
